STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
int32_t ism330dhcx_xl_usr_offset_y_set(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_y_get(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_z_set(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_z_get(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_usr_offset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_timestamp_rst(const stmdev_ctx_t *ctx);

int32_t ism330dhcx_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_timestamp_raw_get(const stmdev_ctx_t *ctx,
                                     uint32_t *val);

typedef enum
{
  ISM330DHCX_NO_ROUND      = 0,
  ISM330DHCX_ROUND_XL      = 1,
  ISM330DHCX_ROUND_GY      = 2,
  ISM330DHCX_ROUND_GY_XL   = 3,
} ism330dhcx_rounding_t;
int32_t ism330dhcx_rounding_mode_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_rounding_t val);
int32_t ism330dhcx_rounding_mode_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_rounding_t *val);

int32_t ism330dhcx_temperature_raw_get(const stmdev_ctx_t *ctx,
                                       int16_t *val);

int32_t ism330dhcx_angular_rate_raw_get(const stmdev_ctx_t *ctx,
                                        int16_t *val);

int32_t ism330dhcx_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                        int16_t *val);

int32_t ism330dhcx_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_mlc_out_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_device_conf_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_device_conf_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_odr_cal_reg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_odr_cal_reg_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_number_of_steps_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t ism330dhcx_steps_reset(const stmdev_ctx_t *ctx);

typedef enum
{
  ISM330DHCX_USER_BANK           = 0,
  ISM330DHCX_SENSOR_HUB_BANK     = 1,
  ISM330DHCX_EMBEDDED_FUNC_BANK  = 2,
} ism330dhcx_reg_access_t;
int32_t ism330dhcx_mem_bank_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_reg_access_t val);
int32_t ism330dhcx_mem_bank_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_reg_access_t *val);

int32_t ism330dhcx_ln_pg_write_byte(const stmdev_ctx_t *ctx,
                                    uint16_t address,
                                    uint8_t *val);
int32_t ism330dhcx_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t address,
                               uint8_t *buf, uint8_t len);
int32_t ism330dhcx_ln_pg_read_byte(const stmdev_ctx_t *ctx, uint16_t add,
                                   uint8_t *val);
int32_t ism330dhcx_ln_pg_read(const stmdev_ctx_t *ctx, uint16_t address,
                              uint8_t *val);

typedef enum
{
  ISM330DHCX_DRDY_LATCHED = 0,
  ISM330DHCX_DRDY_PULSED  = 1,
} ism330dhcx_dataready_pulsed_t;
int32_t ism330dhcx_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                       ism330dhcx_dataready_pulsed_t val);
int32_t ism330dhcx_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                       ism330dhcx_dataready_pulsed_t *val);

int32_t ism330dhcx_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_auto_increment_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dhcx_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_XL_ST_DISABLE  = 0,
  ISM330DHCX_XL_ST_POSITIVE = 1,
  ISM330DHCX_XL_ST_NEGATIVE = 2,
} ism330dhcx_st_xl_t;
int32_t ism330dhcx_xl_self_test_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_xl_t val);
int32_t ism330dhcx_xl_self_test_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_xl_t *val);

typedef enum
{
  ISM330DHCX_GY_ST_DISABLE  = 0,
  ISM330DHCX_GY_ST_POSITIVE = 1,
  ISM330DHCX_GY_ST_NEGATIVE = 3,
} ism330dhcx_st_g_t;
int32_t ism330dhcx_gy_self_test_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_g_t val);
int32_t ism330dhcx_gy_self_test_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_g_t *val);

int32_t ism330dhcx_xl_filter_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_filter_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_gy_filter_lp1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_gy_filter_lp1_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_filter_settling_mask_set(const stmdev_ctx_t *ctx,
                                            uint8_t val);
int32_t ism330dhcx_filter_settling_mask_get(const stmdev_ctx_t *ctx,
                                            uint8_t *val);

typedef enum
{
  ISM330DHCX_ULTRA_LIGHT  = 0,
  ISM330DHCX_VERY_LIGHT   = 1,
  ISM330DHCX_LIGHT        = 2,
  ISM330DHCX_MEDIUM       = 3,
  ISM330DHCX_STRONG       = 4,
  ISM330DHCX_VERY_STRONG  = 5,
  ISM330DHCX_AGGRESSIVE   = 6,
  ISM330DHCX_XTREME       = 7,
} ism330dhcx_ftype_t;
int32_t ism330dhcx_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                        ism330dhcx_ftype_t val);
int32_t ism330dhcx_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_ftype_t *val);

int32_t ism330dhcx_xl_lp2_on_6d_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_lp2_on_6d_get(const stmdev_ctx_t *ctx, uint8_t *val);

