STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
typedef enum
{
  ISM330DHCX_AUX_SPI_4_WIRE = 0,
  ISM330DHCX_AUX_SPI_3_WIRE = 1,
} ism330dhcx_sim_ois_t;
int32_t ism330dhcx_aux_spi_mode_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sim_ois_t val);
int32_t ism330dhcx_aux_spi_mode_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sim_ois_t *val);

typedef enum
{
  ISM330DHCX_351Hz39 = 0,
  ISM330DHCX_236Hz63 = 1,
  ISM330DHCX_172Hz70 = 2,
  ISM330DHCX_937Hz91 = 3,
} ism330dhcx_ftype_ois_t;
int32_t ism330dhcx_aux_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                            ism330dhcx_ftype_ois_t val);
int32_t ism330dhcx_aux_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                            ism330dhcx_ftype_ois_t *val);

typedef enum
{
  ISM330DHCX_AUX_HP_DISABLE = 0x00,
  ISM330DHCX_AUX_HP_Hz016   = 0x10,
  ISM330DHCX_AUX_HP_Hz065   = 0x11,
  ISM330DHCX_AUX_HP_Hz260   = 0x12,
  ISM330DHCX_AUX_HP_1Hz040  = 0x13,
} ism330dhcx_hpm_ois_t;
int32_t ism330dhcx_aux_gy_hp_bandwidth_set(const stmdev_ctx_t *ctx,
                                           ism330dhcx_hpm_ois_t val);
int32_t ism330dhcx_aux_gy_hp_bandwidth_get(const stmdev_ctx_t *ctx,
                                           ism330dhcx_hpm_ois_t *val);

typedef enum
{
  ISM330DHCX_ENABLE_CLAMP  = 0,
  ISM330DHCX_DISABLE_CLAMP = 1,
} ism330dhcx_st_ois_clampdis_t;
int32_t ism330dhcx_aux_gy_clamp_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_ois_clampdis_t val);
int32_t ism330dhcx_aux_gy_clamp_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_st_ois_clampdis_t *val);

typedef enum
{
  ISM330DHCX_AUX_GY_DISABLE = 0,
  ISM330DHCX_AUX_GY_POS     = 1,
  ISM330DHCX_AUX_GY_NEG     = 3,
} ism330dhcx_st_ois_t;
int32_t ism330dhcx_aux_gy_self_test_set(const stmdev_ctx_t *ctx,
                                        ism330dhcx_st_ois_t val);
int32_t ism330dhcx_aux_gy_self_test_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_st_ois_t *val);

typedef enum
{
  ISM330DHCX_631Hz = 0,
  ISM330DHCX_295Hz = 1,
  ISM330DHCX_140Hz = 2,
  ISM330DHCX_68Hz2 = 3,
  ISM330DHCX_33Hz6 = 4,
  ISM330DHCX_16Hz7 = 5,
  ISM330DHCX_8Hz3  = 6,
  ISM330DHCX_4Hz11 = 7,
} ism330dhcx_filter_xl_conf_ois_t;
int32_t ism330dhcx_aux_xl_bandwidth_set(const stmdev_ctx_t *ctx,
                                        ism330dhcx_filter_xl_conf_ois_t val);
int32_t ism330dhcx_aux_xl_bandwidth_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_filter_xl_conf_ois_t *val);

typedef enum
{
  ISM330DHCX_AUX_2g  = 0,
  ISM330DHCX_AUX_16g = 1,
  ISM330DHCX_AUX_4g  = 2,
  ISM330DHCX_AUX_8g  = 3,
} ism330dhcx_fs_xl_ois_t;
int32_t ism330dhcx_aux_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                         ism330dhcx_fs_xl_ois_t val);
int32_t ism330dhcx_aux_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                         ism330dhcx_fs_xl_ois_t *val);

typedef enum
{
  ISM330DHCX_PULL_UP_DISC       = 0,
  ISM330DHCX_PULL_UP_CONNECT    = 1,
} ism330dhcx_sdo_pu_en_t;
int32_t ism330dhcx_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sdo_pu_en_t val);
int32_t ism330dhcx_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sdo_pu_en_t *val);

typedef enum
{
  ISM330DHCX_SPI_4_WIRE = 0,
  ISM330DHCX_SPI_3_WIRE = 1,
} ism330dhcx_sim_t;
int32_t ism330dhcx_spi_mode_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_sim_t val);
int32_t ism330dhcx_spi_mode_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_sim_t *val);

typedef enum
{
  ISM330DHCX_I2C_ENABLE  = 0,
  ISM330DHCX_I2C_DISABLE = 1,
} ism330dhcx_i2c_disable_t;
int32_t ism330dhcx_i2c_interface_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_i2c_disable_t val);
int32_t ism330dhcx_i2c_interface_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_i2c_disable_t *val);

typedef struct
{
  ism330dhcx_int1_ctrl_t          int1_ctrl;
  ism330dhcx_md1_cfg_t            md1_cfg;
  ism330dhcx_emb_func_int1_t      emb_func_int1;
  ism330dhcx_fsm_int1_a_t         fsm_int1_a;
  ism330dhcx_fsm_int1_b_t         fsm_int1_b;
  ism330dhcx_mlc_int1_t           mlc_int1;
} ism330dhcx_pin_int1_route_t;
int32_t ism330dhcx_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                      ism330dhcx_pin_int1_route_t *val);
int32_t ism330dhcx_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                      ism330dhcx_pin_int1_route_t *val);

typedef struct
{
  ism330dhcx_int2_ctrl_t          int2_ctrl;
  ism330dhcx_md2_cfg_t            md2_cfg;
  ism330dhcx_emb_func_int2_t      emb_func_int2;
  ism330dhcx_fsm_int2_a_t         fsm_int2_a;
  ism330dhcx_fsm_int2_b_t         fsm_int2_b;
  ism330dhcx_mlc_int2_t           mlc_int2;
} ism330dhcx_pin_int2_route_t;
int32_t ism330dhcx_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                      ism330dhcx_pin_int2_route_t *val);
int32_t ism330dhcx_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                      ism330dhcx_pin_int2_route_t *val);

typedef enum
{
  ISM330DHCX_PUSH_PULL   = 0,
  ISM330DHCX_OPEN_DRAIN  = 1,
} ism330dhcx_pp_od_t;
int32_t ism330dhcx_pin_mode_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_pp_od_t val);
int32_t ism330dhcx_pin_mode_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_pp_od_t *val);

typedef enum
{
  ISM330DHCX_ACTIVE_HIGH = 0,
  ISM330DHCX_ACTIVE_LOW  = 1,
} ism330dhcx_h_lactive_t;
int32_t ism330dhcx_pin_polarity_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_h_lactive_t val);
int32_t ism330dhcx_pin_polarity_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_h_lactive_t *val);

int32_t ism330dhcx_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

