STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
typedef enum
{
  ISM330DHCX_ALL_INT_PULSED            = 0,
  ISM330DHCX_BASE_LATCHED_EMB_PULSED   = 1,
  ISM330DHCX_BASE_PULSED_EMB_LATCHED   = 2,
  ISM330DHCX_ALL_INT_LATCHED           = 3,
} ism330dhcx_lir_t;
int32_t ism330dhcx_int_notification_set(const stmdev_ctx_t *ctx,
                                        ism330dhcx_lir_t val);
int32_t ism330dhcx_int_notification_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_lir_t *val);

typedef enum
{
  ISM330DHCX_LSb_FS_DIV_64       = 0,
  ISM330DHCX_LSb_FS_DIV_256      = 1,
} ism330dhcx_wake_ths_w_t;
int32_t ism330dhcx_wkup_ths_weight_set(const stmdev_ctx_t *ctx,
                                       ism330dhcx_wake_ths_w_t val);
int32_t ism330dhcx_wkup_ths_weight_get(const stmdev_ctx_t *ctx,
                                       ism330dhcx_wake_ths_w_t *val);

int32_t ism330dhcx_wkup_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_wkup_threshold_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t ism330dhcx_xl_usr_offset_on_wkup_set(const stmdev_ctx_t *ctx,
                                             uint8_t val);
int32_t ism330dhcx_xl_usr_offset_on_wkup_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t ism330dhcx_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_gy_sleep_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_gy_sleep_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_DRIVE_SLEEP_CHG_EVENT = 0,
  ISM330DHCX_DRIVE_SLEEP_STATUS    = 1,
} ism330dhcx_sleep_status_on_int_t;
int32_t ism330dhcx_act_pin_notification_set(const stmdev_ctx_t *ctx,
                                            ism330dhcx_sleep_status_on_int_t val);
int32_t ism330dhcx_act_pin_notification_get(const stmdev_ctx_t *ctx,
                                            ism330dhcx_sleep_status_on_int_t *val);

typedef enum
{
  ISM330DHCX_XL_AND_GY_NOT_AFFECTED      = 0,
  ISM330DHCX_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  ISM330DHCX_XL_12Hz5_GY_SLEEP           = 2,
  ISM330DHCX_XL_12Hz5_GY_PD              = 3,
} ism330dhcx_inact_en_t;
int32_t ism330dhcx_act_mode_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_inact_en_t val);
int32_t ism330dhcx_act_mode_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_inact_en_t *val);

int32_t ism330dhcx_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_act_sleep_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_detection_on_z_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_z_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t ism330dhcx_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_tap_threshold_x_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_x_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  ISM330DHCX_XYZ = 0,
  ISM330DHCX_YXZ = 1,
  ISM330DHCX_XZY = 2,
  ISM330DHCX_ZYX = 3,
  ISM330DHCX_YZX = 5,
  ISM330DHCX_ZXY = 6,
} ism330dhcx_tap_priority_t;
int32_t ism330dhcx_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t val);
int32_t ism330dhcx_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t *val);

int32_t ism330dhcx_tap_threshold_y_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_y_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_tap_threshold_z_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_tap_threshold_z_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_ONLY_SINGLE        = 0,
  ISM330DHCX_BOTH_SINGLE_DOUBLE = 1,
} ism330dhcx_single_double_tap_t;
int32_t ism330dhcx_tap_mode_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t val);
int32_t ism330dhcx_tap_mode_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t *val);

typedef enum
{
  ISM330DHCX_DEG_80  = 0,
  ISM330DHCX_DEG_70  = 1,
  ISM330DHCX_DEG_60  = 2,
  ISM330DHCX_DEG_50  = 3,
} ism330dhcx_sixd_ths_t;
int32_t ism330dhcx_6d_threshold_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t val);
int32_t ism330dhcx_6d_threshold_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t *val);

int32_t ism330dhcx_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_FF_TSH_156mg = 0,
  ISM330DHCX_FF_TSH_219mg = 1,
  ISM330DHCX_FF_TSH_250mg = 2,
  ISM330DHCX_FF_TSH_312mg = 3,
  ISM330DHCX_FF_TSH_344mg = 4,
  ISM330DHCX_FF_TSH_406mg = 5,
  ISM330DHCX_FF_TSH_469mg = 6,
  ISM330DHCX_FF_TSH_500mg = 7,
} ism330dhcx_ff_ths_t;
int32_t ism330dhcx_ff_threshold_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t val);
int32_t ism330dhcx_ff_threshold_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t *val);

