STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
int32_t ism330dhcx_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_fifo_watermark_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t ism330dhcx_fifo_watermark_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t ism330dhcx_compression_algo_init_set(const stmdev_ctx_t *ctx,
                                             uint8_t val);
int32_t ism330dhcx_compression_algo_init_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

typedef enum
{
  ISM330DHCX_CMP_DISABLE  = 0x00,
  ISM330DHCX_CMP_ALWAYS   = 0x04,
  ISM330DHCX_CMP_8_TO_1   = 0x05,
  ISM330DHCX_CMP_16_TO_1  = 0x06,
  ISM330DHCX_CMP_32_TO_1  = 0x07,
} ism330dhcx_uncoptr_rate_t;
int32_t ism330dhcx_compression_algo_set(const stmdev_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t val);
int32_t ism330dhcx_compression_algo_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t *val);

int32_t ism330dhcx_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism330dhcx_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                                 uint8_t *val);

int32_t ism330dhcx_compression_algo_real_time_set(const stmdev_ctx_t *ctx,
                                                  uint8_t val);
int32_t ism330dhcx_compression_algo_real_time_get(const stmdev_ctx_t *ctx,
                                                  uint8_t *val);

int32_t ism330dhcx_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  ISM330DHCX_XL_NOT_BATCHED       =  0,
  ISM330DHCX_XL_BATCHED_AT_12Hz5   =  1,
  ISM330DHCX_XL_BATCHED_AT_26Hz    =  2,
  ISM330DHCX_XL_BATCHED_AT_52Hz    =  3,
  ISM330DHCX_XL_BATCHED_AT_104Hz   =  4,
  ISM330DHCX_XL_BATCHED_AT_208Hz   =  5,
  ISM330DHCX_XL_BATCHED_AT_417Hz   =  6,
  ISM330DHCX_XL_BATCHED_AT_833Hz   =  7,
  ISM330DHCX_XL_BATCHED_AT_1667Hz  =  8,
  ISM330DHCX_XL_BATCHED_AT_3333Hz  =  9,
  ISM330DHCX_XL_BATCHED_AT_6667Hz  = 10,
  ISM330DHCX_XL_BATCHED_AT_6Hz5    = 11,
} ism330dhcx_bdr_xl_t;
int32_t ism330dhcx_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_bdr_xl_t val);
int32_t ism330dhcx_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_bdr_xl_t *val);

typedef enum
{
  ISM330DHCX_GY_NOT_BATCHED         = 0,
  ISM330DHCX_GY_BATCHED_AT_12Hz5    = 1,
  ISM330DHCX_GY_BATCHED_AT_26Hz     = 2,
  ISM330DHCX_GY_BATCHED_AT_52Hz     = 3,
  ISM330DHCX_GY_BATCHED_AT_104Hz    = 4,
  ISM330DHCX_GY_BATCHED_AT_208Hz    = 5,
  ISM330DHCX_GY_BATCHED_AT_417Hz    = 6,
  ISM330DHCX_GY_BATCHED_AT_833Hz    = 7,
  ISM330DHCX_GY_BATCHED_AT_1667Hz   = 8,
  ISM330DHCX_GY_BATCHED_AT_3333Hz   = 9,
  ISM330DHCX_GY_BATCHED_AT_6667Hz   = 10,
  ISM330DHCX_GY_BATCHED_6Hz5        = 11,
} ism330dhcx_bdr_gy_t;
int32_t ism330dhcx_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_bdr_gy_t val);
int32_t ism330dhcx_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_bdr_gy_t *val);

typedef enum
{
  ISM330DHCX_BYPASS_MODE             = 0,
  ISM330DHCX_FIFO_MODE               = 1,
  ISM330DHCX_STREAM_TO_FIFO_MODE     = 3,
  ISM330DHCX_BYPASS_TO_STREAM_MODE   = 4,
  ISM330DHCX_STREAM_MODE             = 6,
  ISM330DHCX_BYPASS_TO_FIFO_MODE     = 7,
} ism330dhcx_fifo_mode_t;
int32_t ism330dhcx_fifo_mode_set(const stmdev_ctx_t *ctx,
                                 ism330dhcx_fifo_mode_t val);
int32_t ism330dhcx_fifo_mode_get(const stmdev_ctx_t *ctx,
                                 ism330dhcx_fifo_mode_t *val);

typedef enum
{
  ISM330DHCX_TEMP_NOT_BATCHED        = 0,
  ISM330DHCX_TEMP_BATCHED_AT_52Hz    = 1,
  ISM330DHCX_TEMP_BATCHED_AT_12Hz5   = 2,
  ISM330DHCX_TEMP_BATCHED_AT_1Hz6    = 3,
} ism330dhcx_odr_t_batch_t;
int32_t ism330dhcx_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                       ism330dhcx_odr_t_batch_t val);
int32_t ism330dhcx_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                       ism330dhcx_odr_t_batch_t *val);

typedef enum
{
  ISM330DHCX_NO_DECIMATION = 0,
  ISM330DHCX_DEC_1         = 1,
  ISM330DHCX_DEC_8         = 2,
  ISM330DHCX_DEC_32        = 3,
} ism330dhcx_odr_ts_batch_t;
int32_t ism330dhcx_fifo_timestamp_decimation_set(const stmdev_ctx_t *ctx,
                                                 ism330dhcx_odr_ts_batch_t val);
int32_t ism330dhcx_fifo_timestamp_decimation_get(const stmdev_ctx_t *ctx,
                                                 ism330dhcx_odr_ts_batch_t *val);

typedef enum
{
  ISM330DHCX_XL_BATCH_EVENT   = 0,
  ISM330DHCX_GYRO_BATCH_EVENT = 1,
} ism330dhcx_trig_counter_bdr_t;
int32_t ism330dhcx_fifo_cnt_event_batch_set(const stmdev_ctx_t *ctx,
                                            ism330dhcx_trig_counter_bdr_t val);
int32_t ism330dhcx_fifo_cnt_event_batch_get(const stmdev_ctx_t *ctx,
                                            ism330dhcx_trig_counter_bdr_t *val);

int32_t ism330dhcx_rst_batch_counter_set(const stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t ism330dhcx_rst_batch_counter_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t ism330dhcx_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                               uint16_t val);
int32_t ism330dhcx_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                               uint16_t *val);

int32_t ism330dhcx_fifo_data_level_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t ism330dhcx_fifo_status_get(const stmdev_ctx_t *ctx,
                                   ism330dhcx_fifo_status2_t *val);

int32_t ism330dhcx_fifo_full_flag_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

