STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
int32_t ism330dhcx_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_GYRO_NC_TAG    = 1,
  ISM330DHCX_XL_NC_TAG,
  ISM330DHCX_TEMPERATURE_TAG,
  ISM330DHCX_TIMESTAMP_TAG,
  ISM330DHCX_CFG_CHANGE_TAG,
  ISM330DHCX_XL_NC_T_2_TAG,
  ISM330DHCX_XL_NC_T_1_TAG,
  ISM330DHCX_XL_2XC_TAG,
  ISM330DHCX_XL_3XC_TAG,
  ISM330DHCX_GYRO_NC_T_2_TAG,
  ISM330DHCX_GYRO_NC_T_1_TAG,
  ISM330DHCX_GYRO_2XC_TAG,
  ISM330DHCX_GYRO_3XC_TAG,
  ISM330DHCX_SENSORHUB_SLAVE0_TAG,
  ISM330DHCX_SENSORHUB_SLAVE1_TAG,
  ISM330DHCX_SENSORHUB_SLAVE2_TAG,
  ISM330DHCX_SENSORHUB_SLAVE3_TAG,
  ISM330DHCX_STEP_CPUNTER_TAG,
  ISM330DHCX_GAME_ROTATION_TAG,
  ISM330DHCX_GEOMAG_ROTATION_TAG,
  ISM330DHCX_ROTATION_TAG,
  ISM330DHCX_SENSORHUB_NACK_TAG = 0x19,
} ism330dhcx_fifo_tag_t;
int32_t ism330dhcx_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                       ism330dhcx_fifo_tag_t *val);

int32_t ism330dhcx_fifo_pedo_batch_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_fifo_pedo_batch_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_sh_batch_slave_0_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_sh_batch_slave_0_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t ism330dhcx_sh_batch_slave_1_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_sh_batch_slave_1_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t ism330dhcx_sh_batch_slave_2_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_sh_batch_slave_2_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t ism330dhcx_sh_batch_slave_3_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t ism330dhcx_sh_batch_slave_3_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  ISM330DHCX_DEN_DISABLE    = 0,
  ISM330DHCX_LEVEL_FIFO     = 6,
  ISM330DHCX_LEVEL_LETCHED  = 3,
  ISM330DHCX_LEVEL_TRIGGER  = 2,
  ISM330DHCX_EDGE_TRIGGER   = 4,
} ism330dhcx_den_mode_t;
int32_t ism330dhcx_den_mode_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_den_mode_t val);
int32_t ism330dhcx_den_mode_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_den_mode_t *val);

typedef enum
{
  ISM330DHCX_DEN_ACT_LOW  = 0,
  ISM330DHCX_DEN_ACT_HIGH = 1,
} ism330dhcx_den_lh_t;
int32_t ism330dhcx_den_polarity_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_den_lh_t val);
int32_t ism330dhcx_den_polarity_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_den_lh_t *val);

typedef enum
{
  ISM330DHCX_STAMP_IN_GY_DATA     = 0,
  ISM330DHCX_STAMP_IN_XL_DATA     = 1,
  ISM330DHCX_STAMP_IN_GY_XL_DATA  = 2,
} ism330dhcx_den_xl_g_t;
int32_t ism330dhcx_den_enable_set(const stmdev_ctx_t *ctx,
                                  ism330dhcx_den_xl_g_t val);
int32_t ism330dhcx_den_enable_get(const stmdev_ctx_t *ctx,
                                  ism330dhcx_den_xl_g_t *val);

int32_t ism330dhcx_den_mark_axis_x_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_x_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_den_mark_axis_y_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_y_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_den_mark_axis_z_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_den_mark_axis_z_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t ism330dhcx_pedo_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_pedo_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_pedo_step_detect_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t ism330dhcx_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
                                           uint8_t *buff);
int32_t ism330dhcx_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
                                           uint8_t *buff);

int32_t ism330dhcx_pedo_steps_period_set(const stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t ism330dhcx_pedo_steps_period_get(const stmdev_ctx_t *ctx,
                                         uint16_t *val);

typedef enum
{
  ISM330DHCX_EVERY_STEP     = 0,
  ISM330DHCX_COUNT_OVERFLOW = 1,
} ism330dhcx_carry_count_en_t;
int32_t ism330dhcx_pedo_int_mode_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t val);
int32_t ism330dhcx_pedo_int_mode_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t *val);

int32_t ism330dhcx_motion_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_motion_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_motion_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                              uint8_t *val);

int32_t ism330dhcx_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tilt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                            uint8_t *val);

int32_t ism330dhcx_mag_sensitivity_set(const stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t ism330dhcx_mag_sensitivity_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t ism330dhcx_mag_offset_set(const stmdev_ctx_t *ctx, int16_t *val);
int32_t ism330dhcx_mag_offset_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t ism330dhcx_mag_soft_iron_set(const stmdev_ctx_t *ctx,
                                     uint16_t *val);
int32_t ism330dhcx_mag_soft_iron_get(const stmdev_ctx_t *ctx,
                                     uint16_t *val);

