STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
typedef enum
{
  ISM330DHCX_Z_EQ_Y     = 0,
  ISM330DHCX_Z_EQ_MIN_Y = 1,
  ISM330DHCX_Z_EQ_X     = 2,
  ISM330DHCX_Z_EQ_MIN_X = 3,
  ISM330DHCX_Z_EQ_MIN_Z = 4,
  ISM330DHCX_Z_EQ_Z     = 5,
} ism330dhcx_mag_z_axis_t;
int32_t ism330dhcx_mag_z_orient_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t val);
int32_t ism330dhcx_mag_z_orient_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t *val);

typedef enum
{
  ISM330DHCX_Y_EQ_Y     = 0,
  ISM330DHCX_Y_EQ_MIN_Y = 1,
  ISM330DHCX_Y_EQ_X     = 2,
  ISM330DHCX_Y_EQ_MIN_X = 3,
  ISM330DHCX_Y_EQ_MIN_Z = 4,
  ISM330DHCX_Y_EQ_Z     = 5,
} ism330dhcx_mag_y_axis_t;
int32_t ism330dhcx_mag_y_orient_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t val);
int32_t ism330dhcx_mag_y_orient_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t *val);

typedef enum
{
  ISM330DHCX_X_EQ_Y     = 0,
  ISM330DHCX_X_EQ_MIN_Y = 1,
  ISM330DHCX_X_EQ_X     = 2,
  ISM330DHCX_X_EQ_MIN_X = 3,
  ISM330DHCX_X_EQ_MIN_Z = 4,
  ISM330DHCX_X_EQ_Z     = 5,
} ism330dhcx_mag_x_axis_t;
int32_t ism330dhcx_mag_x_orient_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t val);
int32_t ism330dhcx_mag_x_orient_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t *val);

int32_t ism330dhcx_long_cnt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                                uint8_t *val);

int32_t ism330dhcx_emb_fsm_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_emb_fsm_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  ism330dhcx_fsm_enable_a_t          fsm_enable_a;
  ism330dhcx_fsm_enable_b_t          fsm_enable_b;
} ism330dhcx_emb_fsm_enable_t;
int32_t ism330dhcx_fsm_enable_set(const stmdev_ctx_t *ctx,
                                  ism330dhcx_emb_fsm_enable_t *val);
int32_t ism330dhcx_fsm_enable_get(const stmdev_ctx_t *ctx,
                                  ism330dhcx_emb_fsm_enable_t *val);

int32_t ism330dhcx_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t ism330dhcx_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  ISM330DHCX_LC_NORMAL     = 0,
  ISM330DHCX_LC_CLEAR      = 1,
  ISM330DHCX_LC_CLEAR_DONE = 2,
} ism330dhcx_fsm_lc_clr_t;
int32_t ism330dhcx_long_clr_set(const stmdev_ctx_t *ctx,
                                ism330dhcx_fsm_lc_clr_t val);
int32_t ism330dhcx_long_clr_get(const stmdev_ctx_t *ctx,
                                ism330dhcx_fsm_lc_clr_t *val);

typedef struct
{
  ism330dhcx_fsm_outs1_t    fsm_outs1;
  ism330dhcx_fsm_outs2_t    fsm_outs2;
  ism330dhcx_fsm_outs3_t    fsm_outs3;
  ism330dhcx_fsm_outs4_t    fsm_outs4;
  ism330dhcx_fsm_outs5_t    fsm_outs5;
  ism330dhcx_fsm_outs6_t    fsm_outs6;
  ism330dhcx_fsm_outs7_t    fsm_outs7;
  ism330dhcx_fsm_outs8_t    fsm_outs8;
  ism330dhcx_fsm_outs9_t    fsm_outs9;
  ism330dhcx_fsm_outs10_t    fsm_outs10;
  ism330dhcx_fsm_outs11_t    fsm_outs11;
  ism330dhcx_fsm_outs12_t    fsm_outs12;
  ism330dhcx_fsm_outs13_t    fsm_outs13;
  ism330dhcx_fsm_outs14_t    fsm_outs14;
  ism330dhcx_fsm_outs15_t    fsm_outs15;
  ism330dhcx_fsm_outs16_t    fsm_outs16;
} ism330dhcx_fsm_out_t;
int32_t ism330dhcx_fsm_out_get(const stmdev_ctx_t *ctx,
                               ism330dhcx_fsm_out_t *val);

typedef enum
{
  ISM330DHCX_ODR_FSM_12Hz5 = 0,
  ISM330DHCX_ODR_FSM_26Hz  = 1,
  ISM330DHCX_ODR_FSM_52Hz  = 2,
  ISM330DHCX_ODR_FSM_104Hz = 3,
} ism330dhcx_fsm_odr_t;
int32_t ism330dhcx_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_fsm_odr_t val);
int32_t ism330dhcx_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_fsm_odr_t *val);

int32_t ism330dhcx_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                          uint16_t val);
int32_t ism330dhcx_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                          uint16_t *val);

int32_t ism330dhcx_fsm_number_of_programs_set(const stmdev_ctx_t *ctx,
                                              uint8_t *buff);
int32_t ism330dhcx_fsm_number_of_programs_get(const stmdev_ctx_t *ctx,
                                              uint8_t *buff);

int32_t ism330dhcx_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t ism330dhcx_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                         uint16_t *val);

int32_t ism330dhcx_mlc_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_mlc_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_mlc_status_get(const stmdev_ctx_t *ctx,
                                  ism330dhcx_mlc_status_mainpage_t *val);

typedef enum
{
  ISM330DHCX_ODR_PRGS_12Hz5 = 0,
  ISM330DHCX_ODR_PRGS_26Hz  = 1,
  ISM330DHCX_ODR_PRGS_52Hz  = 2,
  ISM330DHCX_ODR_PRGS_104Hz = 3,
} ism330dhcx_mlc_odr_t;
int32_t ism330dhcx_mlc_data_rate_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_mlc_odr_t val);
int32_t ism330dhcx_mlc_data_rate_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_mlc_odr_t *val);

typedef struct
{
  ism330dhcx_sensor_hub_1_t   sh_byte_1;
  ism330dhcx_sensor_hub_2_t   sh_byte_2;
  ism330dhcx_sensor_hub_3_t   sh_byte_3;
  ism330dhcx_sensor_hub_4_t   sh_byte_4;
  ism330dhcx_sensor_hub_5_t   sh_byte_5;
  ism330dhcx_sensor_hub_6_t   sh_byte_6;
  ism330dhcx_sensor_hub_7_t   sh_byte_7;
  ism330dhcx_sensor_hub_8_t   sh_byte_8;
  ism330dhcx_sensor_hub_9_t   sh_byte_9;
  ism330dhcx_sensor_hub_10_t  sh_byte_10;
  ism330dhcx_sensor_hub_11_t  sh_byte_11;
  ism330dhcx_sensor_hub_12_t  sh_byte_12;
  ism330dhcx_sensor_hub_13_t  sh_byte_13;
  ism330dhcx_sensor_hub_14_t  sh_byte_14;
  ism330dhcx_sensor_hub_15_t  sh_byte_15;
  ism330dhcx_sensor_hub_16_t  sh_byte_16;
  ism330dhcx_sensor_hub_17_t  sh_byte_17;
  ism330dhcx_sensor_hub_18_t  sh_byte_18;
} ism330dhcx_emb_sh_read_t;
int32_t ism330dhcx_sh_read_data_raw_get(const stmdev_ctx_t *ctx,
                                        ism330dhcx_emb_sh_read_t *val,
                                        uint8_t len);

