STMicroelectronics/STM32CubeWBA/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
typedef enum
{
  ISM330DHCX_SLV_0       = 0,
  ISM330DHCX_SLV_0_1     = 1,
  ISM330DHCX_SLV_0_1_2   = 2,
  ISM330DHCX_SLV_0_1_2_3 = 3,
} ism330dhcx_aux_sens_on_t;
int32_t ism330dhcx_sh_slave_connected_set(const stmdev_ctx_t *ctx,
                                          ism330dhcx_aux_sens_on_t val);
int32_t ism330dhcx_sh_slave_connected_get(const stmdev_ctx_t *ctx,
                                          ism330dhcx_aux_sens_on_t *val);

int32_t ism330dhcx_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_EXT_PULL_UP      = 0,
  ISM330DHCX_INTERNAL_PULL_UP = 1,
} ism330dhcx_shub_pu_en_t;
int32_t ism330dhcx_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                   ism330dhcx_shub_pu_en_t val);
int32_t ism330dhcx_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                   ism330dhcx_shub_pu_en_t *val);

int32_t ism330dhcx_sh_pass_through_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_sh_pass_through_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  ISM330DHCX_EXT_ON_INT2_PIN = 1,
  ISM330DHCX_XL_GY_DRDY      = 0,
} ism330dhcx_start_config_t;
int32_t ism330dhcx_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                      ism330dhcx_start_config_t val);
int32_t ism330dhcx_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                      ism330dhcx_start_config_t *val);

typedef enum
{
  ISM330DHCX_EACH_SH_CYCLE    = 0,
  ISM330DHCX_ONLY_FIRST_CYCLE = 1,
} ism330dhcx_write_once_t;
int32_t ism330dhcx_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                     ism330dhcx_write_once_t val);
int32_t ism330dhcx_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                     ism330dhcx_write_once_t *val);

int32_t ism330dhcx_sh_reset_set(const stmdev_ctx_t *ctx);
int32_t ism330dhcx_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_SH_ODR_104Hz = 0,
  ISM330DHCX_SH_ODR_52Hz  = 1,
  ISM330DHCX_SH_ODR_26Hz  = 2,
  ISM330DHCX_SH_ODR_13Hz  = 3,
} ism330dhcx_shub_odr_t;
int32_t ism330dhcx_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                    ism330dhcx_shub_odr_t val);
int32_t ism330dhcx_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                    ism330dhcx_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} ism330dhcx_sh_cfg_write_t;
int32_t ism330dhcx_sh_cfg_write(const stmdev_ctx_t *ctx,
                                ism330dhcx_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} ism330dhcx_sh_cfg_read_t;
int32_t ism330dhcx_sh_slv0_cfg_read(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv1_cfg_read(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv2_cfg_read(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv3_cfg_read(const stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);

int32_t ism330dhcx_sh_status_get(const stmdev_ctx_t *ctx,
                                 ism330dhcx_status_master_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* ISM330DHCX_REGS_H */
